Aidan-Bennett/Wireless-Multi-Sensor-Data-acquisition-system_Code/Arduino Board Files/Board Variant Files/arduino_zero_SAMD21J18A/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Arduino/Genuino Zero (Prorgamming Port)
# ---------------------------------------



arduino_zero_SAMD21J18A.name= Branz Base Station V1
arduino_zero_SAMD21J18A.vid.0=0x239A
arduino_zero_SAMD21J18A.pid.0=0x80DD
arduino_zero_SAMD21J18A.vid.1=0x239A
arduino_zero_SAMD21J18A.pid.1=0x00DD

#arduino_zero_SAMD21J18A.vid.2=0x2341
#arduino_zero_SAMD21J18A.pid.2=0x824d
# If the board is a 2341:824d use 2341:824d for build and set other parameters as well
#arduino_zero_SAMD21J18A.vid.2.build.vid=0x2341
#arduino_zero_SAMD21J18A.vid.2.build.pid=0x824d
#arduino_zero_SAMD21J18A.vid.2.build.usb_product="Genuino Zero"
#arduino_zero_SAMD21J18A.vid.2.bootloader.file=bacon_bs/samd21_sam_ba_genuino.bin

#arduino_zero_SAMD21J18A.vid.3=0x2341
#arduino_zero_SAMD21J18A.pid.3=0x024d
# If the board is a 2341:024d use 2341:824d for build and set other parameters as well
#arduino_zero_SAMD21J18A.vid.3.build.vid=0x2341
#arduino_zero_SAMD21J18A.vid.3.build.pid=0x824d
#arduino_zero_SAMD21J18A.vid.3.build.usb_product="Genuino Zero"
#arduino_zero_SAMD21J18A.vid.3.bootloader.file=bacon_bs/samd21_sam_ba_genuino.bin

arduino_zero_SAMD21J18A.upload.tool=bossac
arduino_zero_SAMD21J18A.upload.protocol=sam-ba
arduino_zero_SAMD21J18A.upload.maximum_size=262144
arduino_zero_SAMD21J18A.upload.use_1200bps_touch=true
arduino_zero_SAMD21J18A.upload.wait_for_upload_port=true
arduino_zero_SAMD21J18A.upload.native_usb=true
arduino_zero_SAMD21J18A.build.mcu=cortex-m0plus
arduino_zero_SAMD21J18A.build.f_cpu=48000000L
arduino_zero_SAMD21J18A.build.usb_product="BACON"
arduino_zero_SAMD21J18A.build.usb_manufacturer="BRANZ"
arduino_zero_SAMD21J18A.build.board=SAMD_SAMD21J18A
arduino_zero_SAMD21J18A.build.core=arduino
arduino_zero_SAMD21J18A.build.extra_flags=-DARDUINO_SAMD_ZERO -D__SAMD21J18A__ {build.usb_flags}
arduino_zero_SAMD21J18A.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_SAMD21J18A.build.openocdscript=openocd_scripts/arduino_zero_SAMD21J18A.cfg
arduino_zero_SAMD21J18A.build.variant=arduino_zero_SAMD21J18A
arduino_zero_SAMD21J18A.build.variant_system_lib=
arduino_zero_SAMD21J18A.build.vid=0x239A
arduino_zero_SAMD21J18A.build.pid=0x80DD
arduino_zero_SAMD21J18A.bootloader.tool=openocd
arduino_zero_SAMD21J18A.bootloader.file=arduino_zero_SAMD21J18A/samd21_sam_ba_J18A.bin


